We have the same issue:
Every terraform apply command attempts to make changes. After confirming with yes, it reports that modifications were successful, but when I check the activity center, it doesn't specify what changes were made.
`  ~ resource "ec_deployment" "cluster" {
      ~ elasticsearch          = {
          ~ cloud_id       = "%%%%HIDDEN%%%%" -> (known after apply)
          ~ config         = {
              + plugins            = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ http_endpoint  = "http://%%%%HIDDEN.us-east-1.aws.found.io:9200" -> (known after apply)
          ~ https_endpoint = "https://%%%%HIDDEN.us-east-1.aws.found.io:443" -> (known after apply)
          ~ resource_id    = "%%%%HIDDEN%%%%%" -> (known after apply)
            # (8 unchanged attributes hidden)
        }
        id                     = "%%%%HIDDEN%%%%"
        name                   = "%%%%HIDDEN%%%%"
        # (11 unchanged attributes hidden)
    }`